### Series

In [31]:
import numpy as np
import pandas as pd
import matplotlib as plt

# 从列表创建Series
pd.Series(['a', 'b', 'c'])

0    a
1    b
2    c
dtype: object

In [10]:
# import pandas as pd
# 通过字典创建带索引的Series
s1 = pd.Series({'a':11, 'b':22, 'c':33})
print(s1)

a    11
b    22
c    33
dtype: int64

In [21]:
# 通过关键字创建带索引的Series
s2 = pd.Series([111, 222, 333], index = ['a', 'b', 'c'])
print(s2)

a    111
b    222
c    333
dtype: int64

**Hint:**
使用index会提升查询性能

+ 如果index唯一，pandas会使用<span class="mark">哈希表</span>优化，查询性能为O(1)
+ 如果index有序不唯一，pandas会使用<span class="mark">二分查找</span>算法，查询性能为O(logN)
+ 如果index完全随机，每次查询都要扫全表，查询性能为O(N)

In [17]:
# 获取全部索引
s1.index

Index(['a', 'b', 'c'], dtype='object')

In [23]:
# 获取全部值
s2.values

array([111, 222, 333])

In [25]:
# 类型
type(s1.values)

numpy.ndarray

In [27]:
# 转换为列表
s1.values.tolist()

[11, 22, 33]

In [32]:
# 取出email
emails = pd.Series(['abc at amazom.com', 'admin1@163.com', 'mat@m.at', 'ab@abc.com'])
import re
pattern ='[A-Za-z0-9._]+@[A-Za-z0-9.-]+\\.[A-Za-z]{2,5}'
mask = emails.map(lambda x: bool(re.match(pattern, x)))
emails[mask]

1    admin1@163.com
2          mat@m.at
3        ab@abc.com
dtype: object

### DataFrame（多行、多列）

In [50]:
pd.DataFrame([[1,2],['a','b']])

   0  1
0  1  2
1  a  b

In [59]:
df = pd.DataFrame([[1,2],['a','b']])
# 自定义列索引
df.columns= ['one', 'two']
print(df)

  one two
0   1   2
1   a   b

In [58]:
df2 = pd.DataFrame([[1,2],['a','b']])
# 自定义行索引
df2.index = ['first', 'second']
print(df2)

        0  1
first   1  2
second  a  b

### 数据导入

In [6]:
'''
导入csv 
'''
csv1 = pd.read_csv('../maoyan.csv')
print(csv1)

          天气之子     \n类型:\n              爱情／动画／奇幻\n              \
0           误杀        \n类型:\n              剧情／犯罪\n
1       唐人街探案2     \n类型:\n              喜剧／动作／悬疑\n
2      哪吒之魔童降世     \n类型:\n              动画／喜剧／奇幻\n
3         少年的你     \n类型:\n              爱情／青春／剧情\n
4          毒液2  \n类型:\n              动作／科幻／惊悚／恐怖\n
5    哥斯拉2：怪兽之王     \n类型:\n              科幻／灾难／动作\n
6          战狼2        \n类型:\n              动作／战争\n
7       恐怖电影院2        \n类型:\n              恐怖／惊悚\n
8  复仇者联盟4：终局之战     \n类型:\n              动作／冒险／奇幻\n

    \n主演:\n              醍醐虎汰朗／森七菜／本田翼\n              \
0        \n主演:\n              肖央／谭卓／陈冲\n
1      \n主演:\n              王宝强／刘昊然／肖央\n
2     \n主演:\n              吕艳婷／囧森瑟夫／瀚墨\n
3     \n主演:\n              周冬雨／易烊千玺／尹昉\n
4  \n主演:\n              汤姆·哈迪／伍迪·哈里森／娜奥米·哈里斯\n   ...
5  \n主演:\n              凯尔·钱德勒／维拉·法梅加／米莉·波比·布朗\n ...
6   \n主演:\n              吴京／弗兰克·格里罗／吴刚\n
7     \n主演:\n              殷果儿／刘小奇／闫薇儿\n
8  \n主演:\n              小罗伯特·唐尼／克里斯·埃文斯／马克·鲁法洛\n ...

   \n上映时间:\n              2019-11-01\n
0  \n上映时间:\n              2019-12-13\n
1  \n上映时间:\n              2018-02-16\n
2  \n上映时间:\n              2019-07-26\n
3  \n上映时间:\n              2019-10-25\n
4  \n上映时间:\n              2020-06-25\n
5  \n上映时间:\n              2019-05-31\n
6  \n上映时间:\n              2017-07-27\n
7  \n上映时间:\n              2017-10-20\n
8  \n上映时间:\n              2019-04-24\n

In [14]:
# 导入excel
excel1 = pd.read_excel('1.xlsx')
print(excel1)

   num1   num2  num3  num4
0     1    4.0     5     7
1    33    NaN    55    66
2   111  222.0   333   444

In [19]:
# 显示前几行
excel1.head(2)

   num1  num2  num3  num4
0     1   4.0     5     7
1    33   NaN    55    66

In [21]:
# 行列数量
excel1.shape

(3, 4)

In [27]:
# 详细信息
excel1.info()
excel1.describe()
# type(excel1.describe())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   num1    3 non-null      int64
 1   num2    2 non-null      float64
 2   num3    3 non-null      int64
 3   num4    3 non-null      int64
dtypes: float64(1), int64(3)
memory usage: 224.0 bytes

             num1        num2        num3        num4
count    3.000000    2.000000    3.000000    3.000000
mean    48.333333  113.000000  131.000000  172.333333
std     56.580326  154.149278  176.714459  237.112491
min      1.000000    4.000000    5.000000    7.000000
25%     17.000000   58.500000   30.000000   36.500000
50%     33.000000  113.000000   55.000000   66.000000
75%     72.000000  167.500000  194.000000  255.000000
max    111.000000  222.000000  333.000000  444.000000

In [28]:
# 指定导入哪个Sheet
pd.read_excel(r'1.xlsx',sheet_name = 0)

   num1   num2  num3  num4
0     1    4.0     5     7
1    33    NaN    55    66
2   111  222.0   333   444

In [30]:
# 数据库读取
# import pymysql
# sql  =  'SELECT *  FROM mytable'
# conn = pymysql.connect('ip','name','pass','dbname','charset=utf8')
# df = pd.read_sql(sql,conn)

### 数据预处理

In [33]:
x = pd.Series([1, 2, 3, np.nan, 4])

In [35]:
# 是否有缺失值
x.hasnans

True

In [40]:
# 将缺省值填充为平均值
x.fillna(value=x.mean())

0    1.0
1    2.0
2    3.0
3    2.5
4    4.0
dtype: float64

In [42]:
# 原有的内容不变
x

0    1.0
1    2.0
2    3.0
3    NaN
4    4.0
dtype: float64

In [44]:
df3=pd.DataFrame({"A":[5,3,None,4], 
                 "B":[None,2,4,3], 
                 "C":[4,3,8,5], 
                 "D":[5,4,2,None]})

In [46]:
df3

     A    B  C    D
0  5.0  NaN  4  5.0
1  3.0  2.0  3  4.0
2  NaN  4.0  8  2.0
3  4.0  3.0  5  NaN

In [50]:
df3.isnull() # 查看缺失值汇总

       A      B      C      D
0  False   True  False  False
1  False  False  False  False
2   True  False  False  False
3  False  False  False   True

In [52]:
df3.isnull().sum() # 查看缺失值汇总

A    1
B    1
C    0
D    1
dtype: int64

In [55]:
df3.ffill() #用上一行填充

     A    B  C    D
0  5.0  NaN  4  5.0
1  3.0  2.0  3  4.0
2  3.0  4.0  8  2.0
3  4.0  3.0  5  2.0

In [57]:
df3.ffill().ffill(axis=1) # 用前一列填充

     A    B    C    D
0  5.0  5.0  4.0  5.0
1  3.0  2.0  3.0  4.0
2  3.0  4.0  8.0  2.0
3  4.0  3.0  5.0  2.0

In [54]:
df3

     A    B  C    D
0  5.0  NaN  4  5.0
1  3.0  2.0  3  4.0
2  NaN  4.0  8  2.0
3  4.0  3.0  5  NaN

In [59]:
# 缺失值删除
df3.info()
df3.dropna()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      float64
 1   B       3 non-null      float64
 2   C       4 non-null      int64
 3   D       3 non-null      float64
dtypes: float64(3), int64(1)
memory usage: 256.0 bytes

     A    B  C    D
1  3.0  2.0  3  4.0

In [61]:
# 填充缺失值
df3.fillna('无')

   A  B  C  D
0  5  无  4  5
1  3  2  3  4
2  无  4  8  2
3  4  3  5  无

In [62]:
# 重复值处理
df3.drop_duplicates()

     A    B  C    D
0  5.0  NaN  4  5.0
1  3.0  2.0  3  4.0
2  NaN  4.0  8  2.0
3  4.0  3.0  5  NaN

### 数据的调整

In [96]:
# 行列调整
df4 = pd.DataFrame({"A":[5,3,None,4], 
                 "B":[None,2,4,3], 
                 "C":[4,3,8,5], 
                 "D":[5,4,2,None]}) 
df4

     A    B  C    D
0  5.0  NaN  4  5.0
1  3.0  2.0  3  4.0
2  NaN  4.0  8  2.0
3  4.0  3.0  5  NaN

#### 选择

In [97]:
# 列的选择,多个列要用列表
df4[ ['A', 'D'] ]

     A    D
0  5.0  5.0
1  3.0  4.0
2  NaN  2.0
3  4.0  NaN

In [68]:
# 某几列
df4.iloc[:, [0,2]] # :表示所有行，获得第1和第3列

     A  C
0  5.0  4
1  3.0  3
2  NaN  8
3  4.0  5

In [72]:
# 行的选择
df4.loc[[1,2]]  # 选择第二行和第三行

     A    B  C    D
1  3.0  2.0  3  4.0
2  NaN  4.0  8  2.0

In [75]:
df4.loc[0:2]  # 选择第一行到第三行

     A    B  C    D
0  5.0  NaN  4  5.0
1  3.0  2.0  3  4.0
2  NaN  4.0  8  2.0

In [82]:
# 比较
df4['A'] < 5

0    False
1     True
2    False
3     True
Name: A, dtype: bool

In [92]:
# 比较选择
df4.loc[ (df4['A'] > 3) & (df4['C'] < 5) ]

     A   B  C    D
0  5.0 NaN  4  5.0

#### 数值替换

In [88]:
# 一对一替换
# 用于单个异常值处理
df4['C'].replace(4,40)

0    40
1     3
2     8
3     5
Name: C, dtype: int64

In [90]:
df4.replace(np.nan, 0)

     A    B  C    D
0  5.0  0.0  4  5.0
1  3.0  2.0  3  4.0
2  0.0  4.0  8  2.0
3  4.0  3.0  5  0.0

In [93]:
# 多对一替换
df4.replace([4,5,8], 1000)

        A       B     C       D
0  1000.0     NaN  1000  1000.0
1     3.0     2.0     3  1000.0
2     NaN  1000.0  1000     2.0
3  1000.0     3.0  1000     NaN

In [95]:
# 多对多替换——字典
df4.replace({4:400,5:500})

       A      B    C      D
0  500.0    NaN  400  500.0
1    3.0    2.0    3  400.0
2    NaN  400.0    8    2.0
3  400.0    3.0  500    NaN

#### 排序

In [101]:
df4.sort_values( by= 'C', ascending=True)

     A    B  C    D
1  3.0  2.0  3  4.0
0  5.0  NaN  4  5.0
3  4.0  3.0  5  NaN
2  NaN  4.0  8  2.0

In [103]:
df4.sort_values( by= ['C','A'], ascending=[True, False])

     A    B  C    D
1  3.0  2.0  3  4.0
0  5.0  NaN  4  5.0
3  4.0  3.0  5  NaN
2  NaN  4.0  8  2.0

#### 删除

In [108]:
# 删除列
df4.drop('A', axis=1)

     B  C    D
0  NaN  4  5.0
1  2.0  3  4.0
2  4.0  8  2.0
3  3.0  5  NaN

In [113]:
# 删除行
df4.drop(2, axis=0)

     A    B  C    D
0  5.0  NaN  4  5.0
1  3.0  2.0  3  4.0
3  4.0  3.0  5  NaN

In [117]:
# 删除特定行
df4[df4['A'] < 4]

     A    B  C    D
1  3.0  2.0  3  4.0

#### 行列互换

In [120]:
# 行列互换
df4.T

     0    1    2    3
A  5.0  3.0  NaN  4.0
B  NaN  2.0  4.0  3.0
C  4.0  3.0  8.0  5.0
D  5.0  4.0  2.0  NaN

In [121]:
df4.T.T

     A    B    C    D
0  5.0  NaN  4.0  5.0
1  3.0  2.0  3.0  4.0
2  NaN  4.0  8.0  2.0
3  4.0  3.0  5.0  NaN

In [125]:
df5 = pd.DataFrame([
                     ['a', 'b', 'c'], 
                     ['d', 'e', 'f']
                    ],
                    columns= ['one', 'two', 'three'],
                    index = ['first', 'second']
                   ) 
df5

       one two three
first    a   b     c
second   d   e     f

In [126]:
df5.stack()

first   one      a
        two      b
        three    c
second  one      d
        two      e
        three    f
dtype: object

In [128]:
df5.unstack()

one    first     a
       second    d
two    first     b
       second    e
three  first     c
       second    f
dtype: object

In [129]:
df5.stack().reset_index()

  level_0 level_1  0
0   first     one  a
1   first     two  b
2   first   three  c
3  second     one  d
4  second     two  e
5  second   three  f